-- Скрипт для налаштування виходу ШІМ на 12 піні МК.

BTN_EXIT = 2 -- Пін кнопки виходу.
PWM_PIN = 12

pwm = require("pwm") -- Підключити модуль pwm в скрипт.

pwm.attach(PWM_PIN, 3000, 8) -- Налаштувати pwm (пін, частота, розрядність).

pwm.set(PWM_PIN, 20) -- Встановити 20% заповнення.

function update() -- Функція викликається автоматично контекстом кожен кадр.
    if input.is_pressed(BTN_EXIT) then -- Обробка кнопки виходу.
        input.lock(BTN_EXIT, 1000) -- Заблокувати спрацьовування кнопки на n мс.
        pwm.detach(PWM_PIN) -- Зупинити ШІМ на піну.
		context.exit() -- Завершити роботу скрипта.
        return;
	end
end