/**
 * @file cpu_config.h
 * @brief Файл базових визначень налаштувань основного мікроконтролера
 * @details
 */

#pragma once

#define BASE_CPU_FREQ_MHZ 360       // Мінімальна частота ядер МК, яка буде використовуватися в коді з низьким навантаженням.
#define BALANCED_CPU_FREQ_MHZ 360  // Частота ядер МК, яка буде використовуватися для задач з середніми вимогами до продуктивності.
#define MAX_CPU_FREQ_MHZ 360       // Максимальна частота ядер МК, яка буде використовуватися в високопродуктивних задачах.
