/**
 * @file input_config.h
 * @brief Файл налаштувань користувацького вводу
 * @details
 */

#pragma once
#include <stdint.h>

// #define EXT_INPUT  // Якщо стан кнопок зчитується з іншого МК по шині I2C.

#ifdef EXT_INPUT
#define EXT_INPUT_B_NUM 1  // Кількість байт(які будуть прочитані по I2C) що містять інформацію про стан кнопок. 1 байт == 8 кнопок.
#endif

// #define TOUCHSCREEN_SUPPORT  // Увімкнути підтримку сенсорного екрану

#ifdef TOUCHSCREEN_SUPPORT
#define TOUCH_ROTATION ROTATION_180  // Може мати значення ROTATION_0/ROTATION_90/ROTATION_180/ROTATION_270
#define TOUCH_WIDTH 1024
#define TOUCH_HEIGHT 600

// -------------------------------- Обрати драйвер сенсорного екрану
#define GT911_DRIVER
// #define AXS15231B_DRIVER

// -------------------------------- Налаштуй піни, до яких підключено драйвер тачскріна
#define PIN_TOUCH_INT -1
#define PIN_TOUCH_RST -1

#endif  // TOUCHSCREEN_SUPPORT

// -------------------------------- Закріплення віртуальних назв кнопок до виводів МК
//
// Якщо стан кнопок зчитується з іншого МК,
// - ідентифікатором віртуальної кнопки має бути позиція біта(зліва направо) в масиві байт.
// Порядок кнопок повинен відповідати визначеному порядку на допоміжному МК.
//
// Якщо стан кнопок зчитується з пінів основного МК,
// - необхідно вказувати номер піна, до якого підключено кнопку або сенсорну панель.
//
// Не можна комбінувати зчитування стану з допоміжного МК та з основного МК одночасно.
namespace pixeler
{
  enum BtnID : uint8_t
  {

  };
}

// Макрос з ініціалізацією пінів. Між фігурними дужками потрібно додати ініціалізацію пінів, як показано нижче
// Де Button(uint8_t btn_id, bool is_touch)
#define BUTTONS_TMPL \
  {                  \
  }

// -------------------------------- Налаштування чутливості сенсорних кнопок
#if defined(CONFIG_IDF_TARGET_ESP32)
#define BTN_TOUCH_TRESHOLD 65  // На ESP32 значення сенсорного датчика зменшується в момент дотику.
#else
#define BTN_TOUCH_TRESHOLD 50000  // На ESP32S3 значення сенсорного датчика збільшується в момент дотику.
#endif

#define PRESS_DURATION (unsigned long)1000  // Час(мс), після спливання якого кнопка вважається утримуваною.

#define PRESS_LOCK (unsigned long)700  // Час(мс) блокування кнопки після спрацювання тригеру PRESS
#define CLICK_LOCK (unsigned long)250  // Час(мс) блокування кнопки після спрацювання тригеру CLICK
#define HOLD_LOCK (unsigned long)150   // Час(мс) блокування кнопки після спрацювання тригеру HOLD
