/**
 * @file battery_config.h
 * @brief Файл налаштуваннь вимірювання напруги акумулятора
 * @details
 */

// #define HAS_BATTERY           // Закоментуй, якщо в проєкті відсутній акумулятор або відсутня перевірка його напруги.
#define PIN_VOLT_MEASH 4      // Пін МК, який підключено до виходу подільника.
#define R_DIV_K 0.7853f       // (R2 / (R1 + R2)) Коефіцієнт подільника напруги, що визначається та коригується для кожного пристрою.
#define VOLTAGE_SAMP_NUM 128  // Кількість вибірок за одне вимірювання.
